Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
    esp_err_t ret = slam_core_init_camera(&camera_config);
    if (ret == ESP_OK) {
        system_status.camera_initialized = true;
        xEventGroupSetBits(system_event_group, CAMERA_READY_BIT);
        ESP_LOGI(TAG, "✅ Camera initialized successfully");
    } else {
        ESP_LOGE(TAG, "❌ Camera initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Initialize GPS module (uBlox)
 */
static esp_err_t initialize_gps(void)
{
    ESP_LOGI(TAG, "🛰️ Initializing uBlox GPS module...");
    
    // Initialize GPS configuration - use loaded config if available
    gps_ublox_config_t gps_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "🛰️ Using loaded GPS configuration");
        gps_config.uart_port = master_config.gps.base_config.uart_port;
        gps_config.baud_rate = master_config.gps.base_config.baud_rate;
        gps_config.tx_pin = master_config.gps.base_config.tx_pin;
        gps_config.rx_pin = master_config.gps.base_config.rx_pin;
        gps_config.update_rate_hz = 5;  // Default 5Hz
        gps_config.enable_sbas = false;
        gps_config.enable_differential = false;
        gps_config.timeout_ms = 10000;
    } else {
        ESP_LOGI(TAG, "🛰️ Using default GPS configuration");
        // Use hardcoded defaults
        gps_config.uart_port = UART_NUM_1;
        gps_config.baud_rate = 9600;
        gps_config.tx_pin = GPS_UART_TX_PIN;
        gps_config.rx_pin = GPS_UART_RX_PIN;
        gps_config.update_rate_hz = 5;
        gps_config.enable_sbas = false;
        gps_config.enable_differential = false;
        gps_config.timeout_ms = 10000;
    }
    
    esp_err_t ret = gps_ublox_init(&gps_config);
    if (ret == ESP_OK) {
        // Test hardware connectivity by checking if GPS is responding
        vTaskDelay(pdMS_TO_TICKS(2000)); // Wait 2 seconds for GPS to initialize
        
        if (gps_ublox_is_connected()) {
            system_status.gps_connected = true;
            xEventGroupSetBits(system_event_group, GPS_READY_BIT);
            ESP_LOGI(TAG, "✅ GPS initialized successfully - hardware connected");
        } else {
            system_status.gps_connected = false;
            ESP_LOGW(TAG, "⚠️ GPS initialized but hardware not detected - no GPS data received");
            ESP_LOGI(TAG, "ℹ️ GPS will continue monitoring for hardware connection");
        }
    } else {
        ESP_LOGE(TAG, "❌ GPS initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Initialize MSP Protocol for INAV communication
 */
static esp_err_t initialize_msp(void)
{
    ESP_LOGI(TAG, "� Initializing MSP Protocol for INAV...");
    
    // Initialize MSP configuration - use loaded config if available
    msp_config_t msp_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "📡 Using loaded MSP configuration");
        msp_config.uart_port = master_config.msp.base_config.uart_port;
        msp_config.baud_rate = master_config.msp.base_config.baud_rate;
        msp_config.tx_pin = master_config.msp.base_config.tx_pin;
        msp_config.rx_pin = master_config.msp.base_config.rx_pin;
        msp_config.timeout_ms = master_config.msp.base_config.timeout_ms;
        msp_config.auto_reconnect = master_config.msp.base_config.auto_reconnect;
    } else {
        ESP_LOGI(TAG, "📡 Using default MSP configuration");
        // Use hardcoded defaults
        msp_config.uart_port = UART_NUM_2;
        msp_config.baud_rate = 115200;
        msp_config.tx_pin = MSP_UART_TX_PIN;
        msp_config.rx_pin = MSP_UART_RX_PIN;
        msp_config.timeout_ms = 5000;
        msp_config.auto_reconnect = true;
    }
    
    esp_err_t ret = msp_protocol_init(&msp_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ MSP Protocol initialized successfully");
        
        // Test MSP connection by requesting status
        ret = msp_request_status();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "� MSP connection test successful");
        } else {
            ESP_LOGW(TAG, "⚠️ MSP connection test failed, but protocol initialized");
        }
    } else {
        ESP_LOGE(TAG, "❌ MSP Protocol initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Initialize Visual SLAM system
 */
static esp_err_t initialize_slam(void)
{
    ESP_LOGI(TAG, "🧠 Initializing Visual SLAM system...");
    
    // Log memory status before SLAM initialization
    ESP_LOGI(TAG, "Memory status before SLAM init:");
    ESP_LOGI(TAG, "  Internal RAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    ESP_LOGI(TAG, "  SPIRAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    ESP_LOGI(TAG, "  Total free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    
    // Initialize SLAM configuration - use loaded config if available
    slam_config_t slam_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "🧠 Using loaded SLAM configuration");
        slam_config.max_features = master_config.slam.base_config.max_features;
        slam_config.fast_threshold = master_config.slam.base_config.fast_threshold;
        slam_config.levels = master_config.slam.base_config.levels;
        slam_config.scale_factor = master_config.slam.base_config.scale_factor;
        slam_config.max_keypoints_per_level = master_config.slam.base_config.max_keypoints_per_level;
        slam_config.use_harris_detector = master_config.slam.base_config.use_harris_detector;
        slam_config.harris_k = master_config.slam.base_config.harris_k;
        slam_config.descriptor_distance_threshold = master_config.slam.base_config.descriptor_distance_threshold;
        slam_config.match_threshold = master_config.slam.base_config.match_threshold;
        slam_config.min_tracked_features = master_config.slam.base_config.min_tracked_features;
        slam_config.keyframe_distance_threshold = master_config.slam.base_config.keyframe_distance_threshold;
        slam_config.keyframe_angle_threshold = master_config.slam.base_config.keyframe_angle_threshold;
        slam_config.max_keyframes = master_config.slam.base_config.max_keyframes;
        slam_config.enable_loop_closure = master_config.slam.base_config.enable_loop_closure;
        slam_config.loop_closure_threshold = master_config.slam.base_config.loop_closure_threshold;
    } else {
        ESP_LOGI(TAG, "🧠 Using default SLAM configuration");
        // Use hardcoded defaults
        slam_config.max_features = 500;
        slam_config.fast_threshold = 20.0f;
        slam_config.levels = 8;
        slam_config.scale_factor = 1.2f;
        slam_config.max_keypoints_per_level = 100;
        slam_config.use_harris_detector = false;
        slam_config.harris_k = 0.04f;
        slam_config.descriptor_distance_threshold = 50;
        slam_config.match_threshold = 0.7f;
        slam_config.min_tracked_features = 30;
        slam_config.keyframe_distance_threshold = 1.0f;
        slam_config.keyframe_angle_threshold = 0.2f;
        slam_config.max_keyframes = 50;
        slam_config.enable_loop_closure = true;
        slam_config.loop_closure_threshold = 0.8f;
    }
    
    esp_err_t ret = slam_core_init(&slam_config);
    if (ret == ESP_OK) {
        system_status.slam_active = true;
        xEventGroupSetBits(system_event_group, SLAM_READY_BIT);
        ESP_LOGI(TAG, "✅ SLAM system initialized successfully");
        
