Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
        // Log memory status after SLAM initialization
        ESP_LOGI(TAG, "Memory status after SLAM init:");
        ESP_LOGI(TAG, "  Internal RAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
        ESP_LOGI(TAG, "  SPIRAM free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
        ESP_LOGI(TAG, "  Total free: %zu bytes", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    } else {
        ESP_LOGE(TAG, "❌ SLAM initialization failed: %s", esp_err_to_name(ret));
    }
    
    return ret;
}

/**
 * Main processing task - handles camera frames and SLAM processing
 */
static void main_processing_task(void *pvParameters)
{
    ESP_LOGI(TAG, "🏃 Main processing task started");
    
    // Wait for all systems to be ready
    EventBits_t bits = xEventGroupWaitBits(system_event_group, ALL_SYSTEMS_READY, 
                                          pdFALSE, pdTRUE, portMAX_DELAY);
    
    if ((bits & ALL_SYSTEMS_READY) == ALL_SYSTEMS_READY) {
        ESP_LOGI(TAG, "🚀 All systems ready - starting main processing loop");
        gpio_set_level(GPIO_NUM_15, 1); // System ready LED
        
        // Start comprehensive logging session
        char session_name[64];
        time_t now = time(NULL);
        struct tm timeinfo;
        localtime_r(&now, &timeinfo);
        strftime(session_name, sizeof(session_name), "slam_mission_%Y%m%d_%H%M%S", &timeinfo);
        
        esp_err_t log_ret = sd_storage_start_comprehensive_logging(session_name);
        if (log_ret == ESP_OK) {
            ESP_LOGI(TAG, "📊 Comprehensive logging started: %s", session_name);
        } else {
            ESP_LOGW(TAG, "⚠️ Failed to start comprehensive logging: %s", esp_err_to_name(log_ret));
        }
    }
    
    TickType_t last_wake_time = xTaskGetTickCount();
    const TickType_t frequency = pdMS_TO_TICKS(33); // ~30 FPS
    uint32_t loop_counter = 0;
    
    while (1) {
        uint64_t loop_start_time = esp_timer_get_time();
        loop_counter++;
        
        // Get camera frame
        camera_frame_t frame;
        esp_err_t ret = slam_core_get_frame(&frame);
        
        if (ret == ESP_OK && frame.data != NULL) {
            system_status.frame_count++;
            
            // Toggle SLAM activity LED
            static bool slam_led_state = false;
            slam_led_state = !slam_led_state;
            gpio_set_level(GPIO_NUM_16, slam_led_state);
            
            // Process frame through ORB feature detection
            uint64_t feature_start_time = esp_timer_get_time();
            orb_features_t features;
            ret = orb_features_extract(&frame, &features);
            uint64_t feature_end_time = esp_timer_get_time();
            float feature_processing_time = (feature_end_time - feature_start_time) / 1000.0f;
            
            if (ret == ESP_OK) {
                system_status.feature_count = features.count;
                
                // Log feature extraction data
                sd_storage_log_feature_data(loop_start_time, features.count, 
                                          features.num_good_matches, feature_processing_time);
                
                // Get sensor fusion data
                sensor_fusion_data_t sensor_data;
                sensor_fusion_get_data(&sensor_data);
                
                // Log sensor data (GPS, IMU)
                sd_storage_log_sensor_data(loop_start_time,
                                          sensor_data.gps_data.latitude, sensor_data.gps_data.longitude, sensor_data.gps_data.altitude,
                                          sensor_data.imu_data.accel_x, sensor_data.imu_data.accel_y, sensor_data.imu_data.accel_z,
                                          sensor_data.imu_data.gyro_x, sensor_data.imu_data.gyro_y, sensor_data.imu_data.gyro_z);
                
                // Update system status
                system_status.position_x = sensor_data.position.x;
                system_status.position_y = sensor_data.position.y;
                system_status.position_z = sensor_data.position.z;
                system_status.attitude_roll = sensor_data.attitude.roll;
                system_status.attitude_pitch = sensor_data.attitude.pitch;
                system_status.attitude_yaw = sensor_data.attitude.yaw;
                
                // Process through SLAM core  
                slam_pose_t slam_pose;
                ret = slam_core_process_frame(&frame, &slam_pose);
                
                if (ret == ESP_OK) {
                    // Log SLAM pose for mission recording (if active)
                    log_current_slam_pose();
                    
                    // Get SLAM system statistics and log them
                    slam_stats_t slam_stats;
                    esp_err_t stats_ret = slam_core_get_stats(&slam_stats);
                    if (stats_ret == ESP_OK) {
                        sd_storage_log_system_status(loop_start_time, &slam_stats);
                    }
                } else {
                    // Log SLAM processing error
                    sd_storage_log_error_event(loop_start_time, "SLAM_CORE", ret, 
                                              "Failed to process camera frame");
                }
            } else {
                // Log feature extraction error
                sd_storage_log_error_event(loop_start_time, "ORB_FEATURES", ret, 
                                          "Failed to extract ORB features");
            }
            
            // Release frame buffer
            slam_core_release_frame(&frame);
        } else {
            // Log camera frame error
            if (ret != ESP_OK) {
                sd_storage_log_error_event(loop_start_time, "CAMERA", ret, 
                                          "Failed to get camera frame");
            }
        }
        
        // Log memory usage every 30 seconds (at ~30 FPS)
        if (loop_counter % 900 == 0) {
            sd_storage_log_memory_usage(loop_start_time);
        }
        
        // Check for auto-save conditions (every few iterations)
        static uint32_t auto_save_counter = 0;
        if (++auto_save_counter >= 1000) {  // Check every ~33 seconds at 30Hz
            auto_save_map_if_needed();
            auto_save_counter = 0;
            
            // Log system health status
            ESP_LOGI(TAG, "🧠 SLAM Status: frames=%lu, features=%lu, mem_free=%zu KB", 
                     system_status.frame_count, system_status.feature_count,
                     heap_caps_get_free_size(MALLOC_CAP_8BIT) / 1024);
        }
        
        // Maintain consistent timing
        vTaskDelayUntil(&last_wake_time, frequency);
    }
}

/**
 * Web interface task - handles HTTP server and WebSocket communications
 */
static void web_interface_task(void *pvParameters)
{
    ESP_LOGI(TAG, "🌐 Web interface task started (WiFi disabled)");
    
