Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
}

/**
 * Application main entry point
 */
void app_main(void)
{
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "🚁 Visual SLAM Navigation Module for INAV");
    ESP_LOGI(TAG, "📡 ESP32-P4-WIFI6 with OV5647 MIPI-CSI Camera");
    ESP_LOGI(TAG, "🧠 Real-time ORB-SLAM with Web Interface");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "");

    // Validate pin assignments at compile time
    VALIDATE_ALL_PIN_ASSIGNMENTS;

    ESP_LOGI(TAG, "✅ Pin configuration validated - no conflicts detected");

    // Initialize system components
    initialize_nvs();
    initialize_gpio();
    
    // Create system synchronization objects
    system_mutex = xSemaphoreCreateMutex();
    system_event_group = xEventGroupCreate();
    
    if (system_mutex == NULL || system_event_group == NULL) {
        ESP_LOGE(TAG, "❌ Failed to create synchronization objects");
        return;
    }
    
    // Initialize TCP/IP stack (disabled - WiFi not available)
    // ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    
    // Initialize hardware subsystems
    esp_err_t ret;
    
    // Initialize SD card storage FIRST (before components that need config)
    ESP_LOGI(TAG, "💾 Initializing SD card storage... (early init for config loading)");
    ret = map_manager_init();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ SD card storage initialized successfully");

        // Initialize configuration loader
        ESP_LOGI(TAG, "⚙️ Initializing configuration loader... (early init for component config)");
        ret = config_loader_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Configuration loader initialized successfully");

            // Load master configuration BEFORE initializing components
            ESP_LOGI(TAG, "📖 Loading master configuration... (before component init)");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");

                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "📝 Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");

                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
        } else {
            ESP_LOGE(TAG, "❌ Configuration loader initialization failed: %s", esp_err_to_name(ret));
            ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
        }
    } else {
        ESP_LOGE(TAG, "❌ SD card storage initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults (no SD card available)");
    }
    
    // Now initialize components with loaded configuration
    ret = initialize_camera();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Camera initialization failed, continuing anyway...");
    }
    
    ret = initialize_gps();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "GPS initialization failed, continuing anyway...");
    }
    
    ret = initialize_msp();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "MSP initialization failed, continuing anyway...");
    }
    
    // Initialize IMU
    ret = sensor_fusion_register_imu(&master_config.imu.base_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "IMU registration failed, continuing anyway...");
    }
    
    // List available maps (if SD card was initialized earlier)
    if (config_loader_is_sd_available()) {
        list_available_maps();

        // Try to load a default map if available
        ESP_LOGI(TAG, "🗺️ Checking for existing maps to load...");
        ret = load_slam_map(NULL);  // Load latest map
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Existing map loaded successfully");
        } else {
            ESP_LOGI(TAG, "ℹ️ No existing map found, starting fresh");
        }
    }

            // First try to load existing configuration
            ESP_LOGI(TAG, "� Loading master configuration...");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");
                
                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "� Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");
                    
                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
    // Initialize SLAM system
    ret = initialize_slam();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SLAM initialization failed, continuing anyway...");
    }

    // Save current configuration to SD card (if SD card is available)
    if (config_loader_is_sd_available()) {
        ESP_LOGI(TAG, "💾 Saving initial configuration to SD card...");
        save_configuration_to_sd();
    }

    // Create main processing tasks
    xTaskCreatePinnedToCore(
        main_processing_task,
        "main_processing",
        8192,
        NULL,
        5,
        &main_processing_task_handle,
        1  // Pin to core 1
    );
    
    xTaskCreatePinnedToCore(
        web_interface_task,
        "web_interface",
        8192,
        NULL,
        4,
        &web_interface_task_handle,
        0  // Pin to core 0
    );
    
    xTaskCreatePinnedToCore(
        telemetry_broadcast_task,
        "telemetry_broadcast",
        4096,
        NULL,
        3,
        &telemetry_broadcast_task_handle,
        0  // Pin to core 0
    );
    
    // Create sensor monitoring task for GPS/IMU/MSP reconnection
    xTaskCreatePinnedToCore(
        sensor_monitoring_task,
        "sensor_monitor",
        4096,
        NULL,
        2,
        &sensor_monitoring_task_handle,
        0  // Pin to core 0
    );
    
    ESP_LOGI(TAG, "🚀 Visual SLAM Navigation Module started successfully!");
    ESP_LOGI(TAG, "🌐 Web interface: Connect to WiFi or use captive portal");
    ESP_LOGI(TAG, "📱 Access dashboard at: http://dronecam.local or device IP");
    
    // Main loop - monitor system health
    while (1) {
        // Check task health
        if (main_processing_task_handle != NULL && 
            eTaskGetState(main_processing_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Main processing task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        if (web_interface_task_handle != NULL && 
            eTaskGetState(web_interface_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Web interface task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
    
    // Cleanup (should never reach here, but good practice)
    sd_storage_stop_comprehensive_logging();
}
